# Разгледайте данните homedata от пакета UsingR.
install.packages("UsingR")
library(UsingR)

head(homedata)

# Създайте два вектора съдържащи цените на къщите през 1970 и 2000г.
attach(homedata)
detach(homedata)

head(y1970)
head(y2000)

# Определете:
# а) най-скъпата и най-евтината къща през 2000г, техните цени през 1970г
minPrice <- min(y2000); minPrice
maxPrice <- max(y2000); maxPrice

y1970[which(y2000 == minPrice)] # y1970[which.min(y2000)]
y1970[which(y2000 == maxPrice)] # y1970[which.max(y2000)]

# б) цените на 5-те най-скъпи къщи през 2000г
tail(sort(y2000), 5)

# в) броят на къщите по-скъпи от 750 000 през 2000г
sum(y2000 > 750000)
# изкарайте цените им
y2000[y2000 > 750000]

# г) средната цена през 1970г на къщите от в)
mean(y1970[y2000 > 750000])

# д) цената през 2000г на тези къщи, чиято цена е намаляла
y2000[which(y2000 < y1970)]

# е) 10-те къщи с най-голямо процентно увеличение на цената
tail(order((y2000-y1970)/y1970), 10)
# tail(sort((y2000-y1970)/y1970), 10)
