# Мишо е използвал приложение на телефона си за да записва броя на чашите вода (250мл), които е изпил всеки един от дните от 1ви до 30ти септември. Получил е следните данни:
# 1, 3, 5, 4, 6, 4, 1, 3, 8, 3, 1, 0, 2, 5, 7, 9, 12, 7, 5, 3, 5, 8, 6, 7, 10, 8, 14, 13, 10, 12.

data = c(1, 3, 5, 4, 6, 4, 1, 3, 8, 3, 1, 0, 2, 5, 7, 9, 12, 7, 5, 3, 5, 8, 6, 7, 10, 8, 14, 13, 10, 12)

# Средно, колко литра вода пие на ден?
mean(data) * 0.25

# Целта, която си е поставил в приложението е да пие поне 1.5 литра вода на ден. Колко от дните е изпълнил целта си?
sum(data * 0.25 >= 1.5)

# Кой ден от месеца е изпил най-много вода и колко максилмално литра е изпил за 1 ден?
which.max(data); max(data) * 0.25

# Кой ден от месеца е изпил най-малко вода?
which.min(data)

# Най-често, колко чаши е пил на ден?
sort(table(data))

# Колко литра вода е изпил общо за месец септември Мишо?
sum(data) * 0.25

# Как се е изменяло количеството на изпитата вода от ден на ден на Мишо? В какъв процент от дните тенденцията е била на горе или е оставала без промяна?
d = diff(data); d
sum(d >= 0)/length(data) * 100

# През колко от дните Мишо е постигал точно целта си?
sum(data * 0.25 == 1.5)